{
  "basics": {
    "name": "Tim Jefferies",
    "label": "DevOps and Solutions Architect",
    "email": "Tim.Jefferies@gmail.com",
    "phone": "+44 7931314133",
    "url": null,
    "summary": "An accomplished and adaptable DevOps and Solutions Architect, possessing extensive expertise in system architecture and cloud technology. A track record of successfully building, delivering, and maintaining business and technology solutions in diverse sectors, including internet hosting, finance, charitable organizations, retail, and RPA. Boasting a comprehensive technical background and exceptional problem-solving skills, consistently bridging the gap between organizational requirements and cutting-edge technologies. Applies advanced strategies that align with enterprise and technical standards to drive ongoing improvements. Possessing strong communication skills, able to translate complex technical concepts into easily digestible formats for both technical and non-technical stakeholders. Creates collaborative environments and effectively manages expectations to deliver superior results.",
    "location": null,
    "profiles": [
      {
        "network": "LinkedIn",
        "username": "timjefferies",
        "url": "https://linkedin.com/in/timjefferies"
      }
    ]
  },
  "work": [
    {
      "company": "Blue Prism (SSNC)",
      "position": "DevOps Engineer",
      "website": null,
      "startDate": "2021-10",
      "endDate": "",
      "summary": "DevOps Engineer for QA team, supporting Blue Prism RPA Automation SaaS with Azure CI/CD pipelines. Skills used: Terraform, Ansible, Packer, Jenkins, Azure DevOps, Git, Powershell, Python, and Bash.",
      "highlights": [
        "Re-designing Azure pipelines that build custom pre-baked Windows images for QA testing, resolving pipeline breakages and reliability issues using Ansible and improved failovers.",
        "Building automated testing environments with Jinja2 templates that dynamically create Ansible playbooks, drastically reducing test setup time and saving countless hours.",
        "Migrating from colocated servers into Azure pipelines, modernizing the QA testing infrastructure using Testrail, Terraform, and Ansible via CI/CD pipelines, resulting in a modern, resilient, and efficient QA process."
      ]
    },
    {
      "company": "Slater & Gordon Ltd",
      "position": "Solutions Architect",
      "website": null,
      "startDate": "2022-08",
      "endDate": "2024-07",
      "summary": "Led and supported the migration of bare metal servers into the cloud during consolidation phase.",
      "highlights": [
        "Mapped existing infrastructure using Visio, proposed new CI/CD models for cloud migration, including cost analysis and research into improved processes.",
        "Built initial pipelines and environments, created scalable Ansible/Terraform template library.",
        "Authored new policy documents to standardize Git workflows, DevOps processes, and documented new procedures."
      ]
    },
    {
      "company": "Lishi International",
      "position": "System Architect and DevOps",
      "website": null,
      "startDate": "2014-06",
      "endDate": "2020-09",
      "summary": "Managed online operations hosted on Amazon AWS, including backup, DNS management, system design, and redeveloping the entire web presence, moving offline processes to the cloud.",
      "highlights": [
        "Designed and implemented Amazon EC2, SES, S3, VPC infrastructure with Elastic IP, ELB, snapshots, and volume management.",
        "Built bespoke server builds with LEMP stack, optimized performance with NGINX, MYSQL, Redis, OPCache, EXIM, automated via Ansible.",
        "Implemented encrypted differential backups using Rclone and Duplicity, server failover, and risk management procedures.",
        "Set up unattended software upgrades with Bash, Python, WP-CLI, and Wraith.",
        "Configured Discourse, Docker, YAML, and developed custom PHP plugins and themes for WordPress.",
        "Delivered websites via S3 Buckets and developed subscription-based payment solutions with WooCommerce, Learnpress, Cloudflare.",
        "Implemented CRM using two-way sync between WordPress and Airtable."
      ]
    },
    {
      "company": "Skvare",
      "position": "DevOps",
      "website": null,
      "startDate": "2017-07",
      "endDate": "2017-11",
      "summary": "Sysadmin, architecture review and management of core server infrastructure running Linux, LEMP stack, and Drupal.",
      "highlights": [
        "Performance testing and server optimization using JMeter and ApacheBench.",
        "Resolved Drupal, NGINX cache, Opcache, Memcached, and MariaDB bugs.",
        "Built multi-server Master/Slave MySQL cluster for clients.",
        "Managed server configurations via BitBucket Git branches.",
        "Overhauled development processes and documentation.",
        "Created staging, production, and test pipelines using Jenkins.",
        "Configured and managed load balancer."
      ]
    },
    {
      "company": "Yorkshire Electrical Supplies Limited",
      "position": "Consultant",
      "website": null,
      "startDate": "2014-05",
      "endDate": "2015-12",
      "summary": "Freelance consultant for local electrical supply store.",
      "highlights": [
        "Repaired and virtualized outdated LedgerSMB accounting system with automated VMware backups.",
        "Managed and scripted PostgreSQL databases.",
        "Migrated accounting system to Inuit Quickbooks Pro.",
        "Redesigned website using Magento ecommerce."
      ]
    },
    {
      "company": "Mint Wireless Limited",
      "position": "System Administrator",
      "website": null,
      "startDate": "2013-08",
      "endDate": "2014-03",
      "summary": "Part of operations and infrastructure team building a new network payment gateway.",
      "highlights": [
        "Installed HSM hardware and security keys within data center.",
        "Installed Windows and Linux servers on multiple distributions.",
        "Administered monthly Windows Server updates.",
        "Configured servers for PCI compliance and provided documentation.",
        "Researched, implemented, and documented various software and infrastructure solutions.",
        "Set up HAProxy load balancer.",
        "Installed two-factor authentication solutions (Duo Security, Azure).",
        "Implemented automated backup solutions with Bash and Batch scripting."
      ]
    },
    {
      "company": "Webfusion/123-Reg/Pipex",
      "position": "Internet Hosting Support",
      "website": null,
      "startDate": "2008-07",
      "endDate": "2013-01",
      "summary": "Customer support role for premium dedicated server customers, with system administration and automation scripting.",
      "highlights": [
        "Installed dedicated rack servers, virtualization, and system administration.",
        "Used ticketing systems to meet SLA targets.",
        "Handled migrations, backend tuning, and automation scripting.",
        "Documented support processes.",
        "Supported over 6000 dedicated servers (FreeBSD, Linux, Windows).",
        "Configured/maintained Qmail, Exim, MailEnable, IIS, MySQL, Apache/PHP, SSH/RDP.",
        "Repaired databases and optimized MySQL and Apache performance.",
        "Performed package management using apt, yum, pacman, and source builds.",
        "Extensive CLI, cron, Bash/Python scripting.",
        "Officially Parallels Plesk trained.",
        "Server monitoring with Nagios and Cacti."
      ]
    },
    {
      "company": "Teamtalk Media",
      "position": "1st Line Support",
      "website": null,
      "startDate": "2005-08",
      "endDate": "2006-08",
      "summary": "First point of contact IT support for office staff.",
      "highlights": [
        "Installed/supported Windows (NT4 through 2003), Linux, Office suites.",
        "Used Microsoft Exchange, Netmeeting, RDP, GoverLAN, TightVNC.",
        "Administered DNS, roaming profiles, Outlook, and network debugging.",
        "Repaired desktop PCs, servers, and maintained peripherals."
      ]
    }
  ],
  "education": [],
  "skills": [
    {
      "name": "Solution & Enterprise Architecture",
      "level": "",
      "keywords": []
    },
    {
      "name": "Web Design, Integration & Testing",
      "level": "",
      "keywords": []
    },
    {
      "name": "PCI Compliance",
      "level": "",
      "keywords": []
    },
    {
      "name": "Agile Methodology (SCRUM, Kanban)",
      "level": "",
      "keywords": []
    },
    {
      "name": "Technical Analysis, Evaluation & Assurance",
      "level": "",
      "keywords": []
    },
    {
      "name": "Server Performance Testing & Optimization",
      "level": "",
      "keywords": []
    },
    {
      "name": "MS Visio, Draw.io, Miro",
      "level": "",
      "keywords": []
    },
    {
      "name": "Jira, Confluence, Trello, Sharepoint, Slack, Asana, Airtable",
      "level": "",
      "keywords": []
    },
    {
      "name": "JMeter, ApacheBench, Nagios",
      "level": "",
      "keywords": []
    },
    {
      "name": "Virtualbox, VMware, Azure, AWS VM",
      "level": "",
      "keywords": []
    },
    {
      "name": "Linux (Redhat, CentOS, Debian, Ubuntu, FreeBSD)",
      "level": "",
      "keywords": []
    },
    {
      "name": "Windows Server",
      "level": "",
      "keywords": []
    },
    {
      "name": "HSM Hardware, Data Centre installations",
      "level": "",
      "keywords": []
    },
    {
      "name": "AWS EC2, AWS SES, VPC, Sendgrid",
      "level": "",
      "keywords": []
    },
    {
      "name": "Cloud (AWS / Azure SaaS, IaaS, PaaS)",
      "level": "",
      "keywords": []
    },
    {
      "name": "Python, PHP, HTML, CSS, JavaScript",
      "level": "",
      "keywords": []
    },
    {
      "name": "Exim, Dovecot, Postfix, Qmail",
      "level": "",
      "keywords": []
    },
    {
      "name": "Ansible, Jenkins, Docker, Terraform, Packer, CI/CD Pipelines, Kubernetes",
      "level": "",
      "keywords": []
    },
    {
      "name": "Plesk, Cpanel, Webmin, DirectAdmin",
      "level": "",
      "keywords": []
    },
    {
      "name": "NoSQL (MongoDB), PostgreSQL",
      "level": "",
      "keywords": []
    },
    {
      "name": "Drupal, Magento, WordPress",
      "level": "",
      "keywords": []
    }
  ],
  "languages": [],
  "projects": []
}